/*
    TODO: Създайте масив от 20 стойности, който да съдържа само стойностите от 0 до 2.
    TODO: Създайте програма която определя коя е най-дългата поредица от еднакви числа.
    TODO: Изведете в конзолата кое е числото, от кой индекс започва поредицата и колко е дълга поредицата.
    ! Ако има две еднакво дълги поредици от едно и също число то да се взема първата такава поредица.
    ! Ако има две еднакво дълги поредици от различни числа то да се взема тази на по-голямото число.

    * Пример:
    * Масив: 010111002220100222101
    * Числото е: 2
    * Индекса е: 8
    * Дължината е: 3
*/


function solution(arr) {
    
}

solution(([0, 1, 0, 1, 1, 1, 0, 0, 2, 2, 2, 0, 1, 0, 0, 2, 2, 2, 1, 0, 1]));